tutorials/single_phase_elastic/twoStep/pillarsSolidsElastic/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     elasticHBPF_noepss;

startFrom       latestTime;

startTime       0;

stopAt          endTime; //writeNow; //endTime;

endTime         1e-2;

deltaT          1e-6;

writeControl    adjustableRunTime;

writeInterval   5e-3;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.15;
maxDeltaT       1e-4;


// ************************************************************************* //
